test-data/xml/scenario-15-temp-agency.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- Scenario 15: Temporary Agency Worker (Uitzendkracht)
     Agency is legal employer → CompanyID = agency KBO (0123987456)
     Client firm provides the site → WorkPlaceId = W999111222 -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:v1="http://socialsecurity.be/presenceregistration/v1"
                  xmlns:v11="http://socialsecurity.be/presenceregistration/schemas/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:RegisterPresencesRequest>
         <v1:PresenceRegistrationRequest>
            <v11:RegistrationDate>2026-03-16</v11:RegistrationDate>
            <v11:INSS>94071133344</v11:INSS>
            <v11:CompanyID>0123987456</v11:CompanyID>
            <v11:WorkPlaceId>W999111222</v11:WorkPlaceId>
         </v1:PresenceRegistrationRequest>
      </v1:RegisterPresencesRequest>
   </soapenv:Body>
</soapenv:Envelope>
